package com.gmail.squizikbro;

public class Lotery {
//Зробити два масиви з 7 цифр, заповнених випадковими цифрами (від 0 до 9).
//Перший масив - це числа, які загадані фірмою-організатором лотереї.
//Другий масив - це числа, які вгадав гравець.
//Після того, як обидва масиви заповнені цифрами, потрібно відсортувати їх за зростанням будь-яким способом.
//У відсортованих масивах визначити кількість збігів, тобто чисел у двох масивах з однаковим індексом; Наприклад:
//first[3] повинен дорівнювати second[3], як показано нижче.
//Приклад виведення в консоль (збіглися 1й, 4й та 6й елементи):
//[0, 1, 4, 5, 5, 8, 9]
//[1, 1, 2, 3, 5, 6, 9]
//Кількість збігів: 3

    public static void main(String[] args) {

//        int[] lotteryFirm = new int[]{9, 7, 5, 0, 3, 2, 6, 4, 1, 8};
//        int[] lotteryPlayer = new int[]{7, 0, 1, 3, 2, 5, 9, 8, 6, 4};
//
//        for (int i = 0; i < lotteryFirm.length; i++) ;
//        System.out.println(i);

    }
}
